class XConfig {
  static List<String> peopleNameList = [
    "李晨辉",
    "李晓宝",
    "刘丹飏",
    "杨一帆",
    "金英鑫",
    "魏正晨",
    "张石磊",
    "王晨",
    "周先念",
    "王建峰",
  ];

  //角色版 1-13是村民 14-17是外来者 18-21是爪牙 22是恶魔 
  static Map<int, String> roleMap = {
    1: "洗衣妇",
    2: "图书管理员",
    3: "调查员",
    4: "厨师",
    5: "神使",
    6: "预言家",
    7: "送葬者",
    8: "僧侣",
    9: "养鸦人",
    10: "处女",
    11: "杀手",
    12: "军人",
    13: "镇长",
    14: "隐士",
    15: "家仆",
    16: "圣徒",
    17: "酒鬼",
    18: "荡妇",
    19: "男爵",
    20: "间谍",
    21: "毒师",
    22: "恶魔",
  };

  //角色对应数 村民 外来者 爪牙 恶魔
  static Map<int, List> roleConfig = {
    5: [3, 0, 1, 1],
    6: [3, 1, 1, 1],
    7: [5, 0, 1, 1],
    8: [5, 1, 1, 1],
    9: [5, 2, 1, 1],
    10: [7, 0, 2, 1],
    11: [7, 1, 2, 1],
    12: [7, 2, 2, 1],
    13: [9, 0, 3, 1],
    14: [9, 1, 3, 1],
    15: [9, 2, 3, 1],
  };
}
